title: SSH Lateral Movement
id: b5479944-0dcf-4ac8-87d0-184951a96f56
status: experimental
description: Detect lateral movement attempts by monitoring for SSH connections from unexpected subnets.
references:
    - https://attack.mitre.org/techniques/T1021/004/
date: 2022/04/17
author: James
logsource:
    category: iptables
    product: linux
detection:
    selection:
        DestinationPort: 22
    filter:
        SourceIp:
            - '10.10.10.0/24'
            - '10.10.20.0/24'
    condition: selection and not filter
fields:
    - source_host
    - timestamp
    - SourceIp
    - DestinationPort
falsepositives:
     - Vulnerability scanners
     - Inventory scanners
level: medium